# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Steve\Documents\Git\GlowTime\RGB_LED_Matrix.cydsn\RGB_LED_Matrix.cyprj
# Date: Wed, 05 Feb 2014 04:48:05 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 833.33333333333326 -waveform {0 416.666666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 41 81} -nominal_period 833.33333333333326 [list]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Steve\Documents\Git\GlowTime\RGB_LED_Matrix.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Steve\Documents\Git\GlowTime\RGB_LED_Matrix.cydsn\RGB_LED_Matrix.cyprj
# Date: Wed, 05 Feb 2014 04:48:00 GMT
